Code/out_text/nginx_bench_results_configs/configCONFIG_RCU_FANOUT10.txt
RESULTS SET 1
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 2
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 3
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 4
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)


Server Software:        
Server Hostname:        192.168.122.222
Server Port:            80

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   1.368 seconds
Complete requests:      0
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      0 bytes
HTML transferred:       0 bytes
RESULTS SET 5
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 6
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)


Server Software:        
Server Hostname:        192.168.122.222
Server Port:            80

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   1.171 seconds
Complete requests:      0
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      0 bytes
HTML transferred:       0 bytes
RESULTS SET 7
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)


Server Software:        
Server Hostname:        192.168.122.222
Server Port:            80

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   0.364 seconds
Complete requests:      0
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      0 bytes
HTML transferred:       0 bytes
RESULTS SET 8
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 9
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 10
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.122.222 (be patient)
RESULTS SET 1
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.018 seconds
Complete requests:      1024
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    1010
Total transferred:      11121174 bytes
HTML transferred:       10808010 bytes
Requests per second:    56996.55 [#/sec] (mean)
Time per request:       0.877 [ms] (mean)
Time per request:       0.018 [ms] (mean, across all concurrent requests)
Transfer rate:          604504.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.3      1       2
Waiting:        0    1   0.3      1       2
Total:          0    1   0.4      1       2

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      2
  99%      2
 100%      2 (longest request)
RESULTS SET 2
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.019 seconds
Complete requests:      1024
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Keep-Alive requests:    1023
Total transferred:      11264304 bytes
HTML transferred:       10947123 bytes
Requests per second:    55318.46 [#/sec] (mean)
Time per request:       0.904 [ms] (mean)
Time per request:       0.018 [ms] (mean, across all concurrent requests)
Transfer rate:          594257.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.4      1       3
Waiting:        0    1   0.4      1       3
Total:          0    1   0.4      1       3

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      2
  99%      2
 100%      3 (longest request)
RESULTS SET 3
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.017 seconds
Complete requests:      1024
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Keep-Alive requests:    1023
Total transferred:      11264304 bytes
HTML transferred:       10947123 bytes
Requests per second:    60832.89 [#/sec] (mean)
Time per request:       0.822 [ms] (mean)
Time per request:       0.016 [ms] (mean, across all concurrent requests)
Transfer rate:          653495.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   1.1      0       6
Waiting:        0    1   1.1      0       6
Total:          0    1   1.1      0       6

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      2
  95%      3
  98%      6
  99%      6
 100%      6 (longest request)
RESULTS SET 4
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.017 seconds
Complete requests:      1024
Failed requests:        14
   (Connect: 0, Receive: 0, Length: 14, Exceptions: 0)
Keep-Alive requests:    1010
Total transferred:      11121174 bytes
HTML transferred:       10808010 bytes
Requests per second:    61240.36 [#/sec] (mean)
Time per request:       0.816 [ms] (mean)
Time per request:       0.016 [ms] (mean, across all concurrent requests)
Transfer rate:          649513.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.7      1       4
Waiting:        0    1   0.7      1       4
Total:          0    1   0.7      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      3
  99%      3
 100%      4 (longest request)
RESULTS SET 5
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.020 seconds
Complete requests:      1024
Failed requests:        11
   (Connect: 0, Receive: 0, Length: 11, Exceptions: 0)
Keep-Alive requests:    1013
Total transferred:      11154204 bytes
HTML transferred:       10840113 bytes
Requests per second:    50458.26 [#/sec] (mean)
Time per request:       0.991 [ms] (mean)
Time per request:       0.020 [ms] (mean, across all concurrent requests)
Transfer rate:          536748.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   1.2      1       6
Waiting:        0    1   1.2      0       6
Total:          0    1   1.2      1       6

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      4
  98%      5
  99%      6
 100%      6 (longest request)
RESULTS SET 6
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.017 seconds
Complete requests:      1024
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Keep-Alive requests:    1017
Total transferred:      11198244 bytes
HTML transferred:       10882917 bytes
Requests per second:    59802.60 [#/sec] (mean)
Time per request:       0.836 [ms] (mean)
Time per request:       0.017 [ms] (mean, across all concurrent requests)
Transfer rate:          638660.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.6      1       4
Waiting:        0    1   0.6      1       4
Total:          0    1   0.6      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      2
  99%      2
 100%      4 (longest request)
RESULTS SET 7
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.018 seconds
Complete requests:      1024
Failed requests:        41
   (Connect: 0, Receive: 0, Length: 41, Exceptions: 0)
Keep-Alive requests:    983
Total transferred:      10823904 bytes
HTML transferred:       10519083 bytes
Requests per second:    57479.65 [#/sec] (mean)
Time per request:       0.870 [ms] (mean)
Time per request:       0.017 [ms] (mean, across all concurrent requests)
Transfer rate:          593332.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.7      1       4
Waiting:        0    1   0.7      1       4
Total:          0    1   0.7      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      3
  99%      3
 100%      4 (longest request)
RESULTS SET 8
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.018 seconds
Complete requests:      1024
Failed requests:        42
   (Connect: 0, Receive: 0, Length: 41, Exceptions: 1)
Keep-Alive requests:    983
Total transferred:      10823904 bytes
HTML transferred:       10519083 bytes
Requests per second:    58020.28 [#/sec] (mean)
Time per request:       0.862 [ms] (mean)
Time per request:       0.017 [ms] (mean, across all concurrent requests)
Transfer rate:          598913.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   0.7      1       5
Waiting:        0    1   0.7      1       4
Total:          0    1   0.8      1       5

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      4
  99%      4
 100%      5 (longest request)
RESULTS SET 9
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.019 seconds
Complete requests:      1024
Failed requests:        9
   (Connect: 0, Receive: 0, Length: 9, Exceptions: 0)
Keep-Alive requests:    1015
Total transferred:      11176224 bytes
HTML transferred:       10861515 bytes
Requests per second:    54225.80 [#/sec] (mean)
Time per request:       0.922 [ms] (mean)
Time per request:       0.018 [ms] (mean, across all concurrent requests)
Transfer rate:          577964.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   1.4      0       9
Waiting:        0    1   1.5      0       9
Total:          0    1   1.5      0       9

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      4
  98%      8
  99%      9
 100%      9 (longest request)
RESULTS SET 10
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        10701 bytes

Concurrency Level:      50
Time taken for tests:   0.040 seconds
Complete requests:      1024
Failed requests:        37
   (Connect: 0, Receive: 0, Length: 37, Exceptions: 0)
Keep-Alive requests:    987
Total transferred:      10867944 bytes
HTML transferred:       10561887 bytes
Requests per second:    25465.67 [#/sec] (mean)
Time per request:       1.963 [ms] (mean)
Time per request:       0.039 [ms] (mean, across all concurrent requests)
Transfer rate:          263938.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    1   4.2      0      38
Waiting:        0    1   4.2      0      38
Total:          0    1   4.2      0      39

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      3
  98%      5
  99%     37
 100%     39 (longest request)